
## Plan Result (terraform/cloudflare/b0xp.io/prometheus-operator)

[CI link](https://github.com/boxp/arch/actions/runs/8692050860)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.prometheus_operator_tunnel_token
  * cloudflare_access_policy.grafana_policy
  * cloudflare_record.grafana
  * cloudflare_tunnel.prometheus_operator_tunnel


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.prometheus_operator_tunnel_token will be created
  + resource "aws_ssm_parameter" "prometheus_operator_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for prometheus-operator tunnel token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "prometheus-operator-tunnel-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_access_policy.grafana_policy will be created
  + resource "cloudflare_access_policy" "grafana_policy" {
      + account_id     = (known after apply)
      + application_id = "e1d59095-eb17-4fbc-97d5-7e5f605689da"
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for grafana.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + github {}
        }
    }

  # cloudflare_record.grafana will be created
  + resource "cloudflare_record" "grafana" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grafana"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.prometheus_operator_tunnel will be created
  + resource "cloudflare_tunnel" "prometheus_operator_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare prometheus-operator tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/prometheus-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/226/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":226,"Program":"tfcmt","SHA1":"ca94736a1d2e9ff7c7c419fdc5abb3cfba281ab8","Target":"terraform/cloudflare/b0xp.io/prometheus-operator","Vars":{},"WorkflowName":"pull_request_target"} -->